ErpTest/src/InformationRegisters/ТаможенныеДекларацииЭкспортКРегистрации/ТаможенныеДекларацииЭкспортКРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТаможенныеДекларацииЭкспортКРегистрации</name>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>РеализацияЭкспорт</name>
    <type>
      <types>DefinedType.ОснованиеСчетФактураВыданный</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/ДанныеОснованийСчетовФактур/ДанныеОснованийСчетовФактур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеОснованийСчетовФактур</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СуммаБезНДС</name>
    <comment>Сумма без НДС в валюте документа</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>Сумма НДС в валюте документа</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДСРегл</name>
    <comment>Сумма без НДС в валюте регламентированного учета</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>БазаНДСРегл</name>
    <comment>Налоговая база</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДСРегл</name>
    <comment>Сумма НДС в валюте регламентированного учета</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <comment>Дата документа</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация документа</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение, от имени которого оформляется документ</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Контрагент документа</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <comment>Договор контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВозврат</name>
    <comment>Признак того, что документ отражает операцию возврата</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлениеОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкаПоСогласованиюСторон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСчетаФактуры</name>
    <comment>Тип счета-фактуры, который формируются на основании документа</comment>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦенности</name>
    <type>
      <types>EnumRef.ВидыЦенностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗапасов</name>
    <type>
      <types>EnumRef.ТипыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УменьшениеСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСчетаФактурыКомиссионера</name>
    <comment>Дата счета-фактуры, выставленного комиссионером (принципалом) покупателю и отраженная в Отчете комиссионера (принципала)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСчетаФактурыКомиссионера</name>
    <comment>Номер счета-фактуры, выставленного комиссионером покупателю</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетФактураВыданныйКомиссионером</name>
    <comment>Счет-фактура выданный покупателю комиссионного товара (агентских услуг)</comment>
    <type>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.СчетФактураКомиссионеру</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПокупательКомиссионногоТовара</name>
    <comment>Покупатель комиссионных товаров (агентских услуг) указанный в Отчете комиссионера (агента)</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорректируемыйДокумент</name>
    <comment>Заполняется в случае исправления ошибок или корректировки по согласованию сторон</comment>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/ВидыЦенностей/ВидыЦенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЦенностей</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные0</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПотребление</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученных</name>
  </enumValues>
  <enumValues>
    <name>ИмуществоСУчетомНДС</name>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентАренда</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентРеализацияИмущества</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентИностранцы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентКомитент</name>
  </enumValues>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыНезавершенногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ОС</name>
  </enumValues>
  <enumValues>
    <name>ПосредническиеУслуги</name>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРаботыИУслуги</name>
  </enumValues>
  <enumValues>
    <name>СМРПодрядные</name>
  </enumValues>
  <enumValues>
    <name>СМРСобственнымиСилами</name>
  </enumValues>
  <enumValues>
    <name>СуммыСвязанныеСРасчетамиПоОплате</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежиОС</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныйСоюз</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>АвансыВыданныеНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученныеНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученныхНалоговыйАгент</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/ТаможеннаяДекларацияЭкспорт/ТаможеннаяДекларацияЭкспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТаможеннаяДекларацияЭкспорт</name>
  <registerRecords>InformationRegister.СведенияТаможенныхДекларацийЭкспорт</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СборСопроводительныхДокументовЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеСчетФактураВыданный</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеСчетФактураВыданный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопроводительныеДокументы</name>
    <attributes>
      <name>КодТС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТСД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТСД</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/InformationRegisters/ТаможенныеДекларацииЭкспортКРегистрации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает виды ценностей НДС, при реализации которых оформляется таможенная декларация на экспорт.
// 
// Параметры:
// Возвращаемое значение:
// 	ВидыЦенностей - Массив - Виды ценностей НДС
//
Функция ОтборВидовЦенностейНДС() Экспорт
	
	ВидыЦенностей = Новый Массив();
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.Товары);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ТоварыНалоговыйАгент);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ОС);
	
	Возврат ВидыЦенностей

КонецФункции

// Возвращает типы налогообложения НДС по экспорту.
// 
// Параметры:
// Возвращаемое значение:
// 	ТипыПродажаНаЭкспорт - Массив - Типы налогообложения НДС по экспорту.
//
Функция ТипыНалогообложенияНДС() Экспорт
	
	ТипыПродажаНаЭкспорт = Новый Массив();
	ТипыПродажаНаЭкспорт.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт);
	ТипыПродажаНаЭкспорт.Добавить(Перечисления.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров);
	ТипыПродажаНаЭкспорт.Добавить(Перечисления.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг);
	
	Возврат ТипыПродажаНаЭкспорт;
	
КонецФункции

// Обновляет состояние документа "Реализация товаров и услуг" в регистре
//
// Параметры:
//   РеализацииЭкспорт - Ссылка на документ реализации.
//
Процедура ОбновитьСостояние(Знач РеализацииЭкспорт) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ВестиУчетТаможенныхДекларацийНаЭкспорт") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеализацииЭкспорт = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РеализацииЭкспорт);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложеннаяТаблица.Организация,
	|	ВложеннаяТаблица.РеализацияЭкспорт,
	|	ВложеннаяТаблица.ДатаРеализации,
	|	ВложеннаяТаблица.Контрагент,
	|	ВложеннаяТаблица.Валюта,
	|	СУММА(ВложеннаяТаблица.СуммаДокумента) КАК СуммаДокумента
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеОснованийСчетовФактур.Организация             КАК Организация,
	|		ДанныеОснованийСчетовФактур.Регистратор             КАК РеализацияЭкспорт,
	|		НАЧАЛОПЕРИОДА(ДанныеОснованийСчетовФактур.Дата, ДЕНЬ) КАК ДатаРеализации,
	|		ДанныеОснованийСчетовФактур.Контрагент              КАК Контрагент,
	|		ДанныеОснованийСчетовФактур.Валюта                  КАК Валюта,
	|		ДанныеОснованийСчетовФактур.СуммаБезНДС 
	|		    + ДанныеОснованийСчетовФактур.СуммаНДС          КАК СуммаДокумента
	|	ИЗ
	|		РегистрСведений.ДанныеОснованийСчетовФактур КАК ДанныеОснованийСчетовФактур
	|		
	|	ГДЕ
	|		ДанныеОснованийСчетовФактур.Регистратор В (&РеализацииЭкспорт)
	|		И ДанныеОснованийСчетовФактур.ВидЦенности В (&ВидыЦенностей)
	|		И ДанныеОснованийСчетовФактур.НалогообложениеНДС В (&ПродажаНаЭкспорт)
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОснованийСчетовФактур.Организация,
	|		ДанныеОснованийСчетовФактур.Регистратор,
	|		НАЧАЛОПЕРИОДА(ДанныеОснованийСчетовФактур.Дата, ДЕНЬ),
	|		ДанныеОснованийСчетовФактур.Контрагент,
	|		ДанныеОснованийСчетовФактур.Валюта,
	|		- (ДанныеОснованийСчетовФактур.СуммаБезНДС + ДанныеОснованийСчетовФактур.СуммаНДС)
	|	ИЗ
	|		РегистрСведений.ДанныеОснованийСчетовФактур КАК ДанныеОснованийСчетовФактур
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ДекларацииЭкспорт
	|		ПО
	|			ДанныеОснованийСчетовФактур.Регистратор = ДекларацииЭкспорт.ДокументОснование
	|	ГДЕ
	|		ДанныеОснованийСчетовФактур.Регистратор В (&РеализацииЭкспорт)
	|		И ДанныеОснованийСчетовФактур.ВидЦенности В (&ВидыЦенностей)
	|		И ДанныеОснованийСчетовФактур.НалогообложениеНДС В (&ПродажаНаЭкспорт)) ВложеннаяТаблица
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВложеннаяТаблица.Организация,
	|	ВложеннаяТаблица.РеализацияЭкспорт,
	|	ВложеннаяТаблица.ДатаРеализации,
	|	ВложеннаяТаблица.Контрагент,
	|	ВложеннаяТаблица.Валюта
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложеннаяТаблица.СуммаДокумента) > 0
	|";
	
	Запрос.УстановитьПараметр("РеализацииЭкспорт", РеализацииЭкспорт);
	ТипыПродажаНаЭкспорт = ТипыНалогообложенияНДС();
	Запрос.УстановитьПараметр("ПродажаНаЭкспорт",  ТипыПродажаНаЭкспорт);
	
	ВидыЦенностей = ОтборВидовЦенностейНДС();
	Запрос.УстановитьПараметр("ВидыЦенностей", ВидыЦенностей);
	
	ТаможенныеДекларацииКРегистрации = Запрос.Выполнить().Выгрузить();
	ТаможенныеДекларацииКРегистрации.Индексы.Добавить("РеализацияЭкспорт");
	
	Для каждого РеализацияЭкспорт Из РеализацииЭкспорт Цикл
		
		МенеджерЗаписи = РегистрыСведений.ТаможенныеДекларацииЭкспортКРегистрации.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.РеализацияЭкспорт = РеализацияЭкспорт;
		
		Строка = ТаможенныеДекларацииКРегистрации.Найти(РеализацияЭкспорт, "РеализацияЭкспорт");
		
		Если Строка = Неопределено Тогда
			МенеджерЗаписи.Удалить();
		Иначе
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Строка);
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
